
Процедура ОбработкаПроведения(Отказ, Режим)
	
	ВалютаРуб = Справочники.Валюты.НайтиПоКоду("643");
	
	// ------ Взаиморасчеты --	
	Если ВидОперации = Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ОплатаПокупателя  Тогда
	
		Движения.Покупатели.Записывать = Истина;
		Движение = Движения.Покупатели.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		
		Движение.Период			= Дата;
		Движение.Контрагент		= Контрагент;
		Движение.Сумма			= Сумма;
		
	КонецЕсли; 
	
	// ------ банк --	
	
	Движения.Банк.Записывать = Истина;
	Движение = Движения.Банк.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	
	Движение.Период	= Дата;
	Движение.Валюта	= Валюта;
	Движение.Счет	= Счет;
	
	Движение.Сумма	= Сумма;
	
	// ------ Доходы --
	
	Если НЕ НеВключатьВДоходы Тогда
	
		Движения.Доходы.Записывать = Истина;
		Движение = Движения.Доходы.Добавить();
		
		Движение.Период	= Дата;
		Движение.Статья	= Статья;
		Движение.Сумма	= Сумма;
	
	КонецЕсли; 
	
КонецПроцедуры
