#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Основание = Параметры.Основание;
		
		Если ЗначениеЗаполнено(Основание) Тогда // создан на основании
			
			Объект.Основание	= Основание;
			ТекстОснование		= Основание;
			
			Объект.Контрагент 	= Основание.Контрагент;
			Объект.Сумма		= Основание.Сумма;
			
			Объект.ВидОперации	= Перечисления.ВидыОперацийПКО.ОплатаПокупателя;
			Объект.Статья		= Справочники.Статьи.НайтиПоНаименованию("Средства, полученные от покупателей и заказчиков");
			Объект.Касса		= Справочники.Кассы.НайтиПоНаименованию("Касса (RUB)");
			Объект.Валюта		= Объект.Касса.ВалютаДенежныхСредств;
			
		ИначеЕсли НЕ ЗначениеЗаполнено(Объект.ВидОперации) Тогда // Новый, НЕ скопирован
			
			Объект.ВидОперации	= Перечисления.ВидыОперацийПКО.ПрочийПриход;
			Объект.Статья		= Справочники.Статьи.НайтиПоНаименованию("Прочие доходы");
			Объект.Касса		= Справочники.Кассы.НайтиПоНаименованию("Касса (RUB)");
			Объект.Валюта		= Объект.Касса.ВалютаДенежныхСредств;
			
			Элементы.Контрагент.Видимость = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ТекстОснование = Объект.Основание;
	
	УправлениеВидимостью();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КассаПриИзменении(Элемент)
	
	КассаПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	ВидОперации_ПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстОснованиеНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура("Ключ", Объект.Основание);
	
	ОткрытьФорму("Документ.Реализация.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатьяПриИзменении(Элемент)
	
	УправлениеВидимостью();
	УправлениеФлагомВключатьВДоходыРасходы();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеФлагомВключатьВДоходыРасходы()
	
	а1 = (Объект.ВидОперации = Перечисления.ВидыОперацийПКО.ПолучениеНаличныхВБанке);
	а2 = Объект.Статья.НеВключатьВДоходы;
	
	Объект.НеВключатьВДоходы = (а1 ИЛИ а2);
	
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостью()
	
	Элементы.СуммаВал.Видимость 	= (Объект.Валюта.Код <> "643");
	Элементы.Счет.Видимость			= (Объект.ВидОперации = Перечисления.ВидыОперацийПКО.ПолучениеНаличныхВБанке);
	Элементы.Контрагент.Видимость	= (Объект.ВидОперации = Перечисления.ВидыОперацийПКО.ОплатаПокупателя);
	
КонецПроцедуры

&НаСервере
Процедура КассаПриИзмененииСервер()
	
	Объект.Валюта = Объект.Касса.ВалютаДенежныхСредств;
	УправлениеВидимостью();
	
КонецПроцедуры

&НаСервере
Процедура ВидОперации_ПриИзмененииСервер()
	
	Объект.Основание	= "";
	ТекстОснование		= "";
	
	УправлениеВидимостью();
	УправлениеФлагомВключатьВДоходыРасходы();
	
КонецПроцедуры

#КонецОбласти
