&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка)
		И НЕ ЗначениеЗаполнено(Объект.ВидОперации) Тогда
		
		Объект.ВидОперации	= Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПрочееСписание;
		Объект.Статья		= Справочники.Статьи.НайтиПоНаименованию("Прочие расходы");
		Объект.Счет			= Справочники.Счета.НайтиПоНаименованию("Карточка VISA Сбер (Владимир)");
		Объект.Валюта		= Объект.Счет.ВалютаДенежныхСредств;
		
	КонецЕсли;
	
	УправлениеВидимостью();
	
КонецПроцедуры

&НаСервере
Процедура УправлениеФлагомВлючатьВДоходыРасходы()
	
	а1 = (Объект.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПереводНаДругойСчет);
	а2 = Объект.Статья.НеВключатьВРасходы;
	
	Объект.НеВключатьВРасходы = (а1 ИЛИ а2);
	
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостью()
	
	Элементы.СуммаВал.Видимость 		= (Объект.Валюта.Код <> "643");
	Элементы.СчетПолучатель.Видимость	= (Объект.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПереводНаДругойСчет);
	Элементы.Контрагент.Видимость		= (Объект.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ОплатаПоставщику);
	Элементы.Назначение.Видимость		= (Объект.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ОплатаПоставщику);

КонецПроцедуры

&НаСервере
Процедура СчетПриИзмененииСервер()
	
	Объект.Валюта = Объект.Счет.ВалютаДенежныхСредств;
	
	УправлениеВидимостью();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетПриИзменении(Элемент)
	
	СчетПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	УправлениеВидимостью();
	УправлениеФлагомВлючатьВДоходыРасходы();
	
КонецПроцедуры

&НаКлиенте
Процедура СтатьяПриИзменении(Элемент)
	
	УправлениеВидимостью();
	УправлениеФлагомВлючатьВДоходыРасходы();
	
КонецПроцедуры


