#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Если Параметры.Свойство("ЗначениеКопирования")
			И ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		
		Иначе
			Объект.ВидОперации	= Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПрочееСписание;
			Объект.Статья		= Справочники.Статьи.НайтиПоНаименованию("Прочие расходы");
			Объект.Валюта		= Справочники.Валюты.НайтиПоКоду("643");
			Объект.Счет			= Справочники.Счета.НайтиПоНаименованию("Карточка МИР СБЕРБАНК");
		КонецЕсли;
		
	КонецЕсли;
	
	УправлениеВидимостью();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СчетПриИзменении(Элемент)
	
	СчетПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	УправлениеВидимостью();
	УправлениеФлагомВключатьВДоходыРасходы();
	
КонецПроцедуры

&НаКлиенте
Процедура СтатьяПриИзменении(Элемент)
	
	УправлениеВидимостью();
	УправлениеФлагомВключатьВДоходыРасходы();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеФлагомВключатьВДоходыРасходы()
	
	а1 = (Объект.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПереводНаДругойСчет);
	а2 = Объект.Статья.НеВключатьВРасходы;
	
	Объект.НеВключатьВРасходы = (а1 ИЛИ а2);
	
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостью()
	
	Элементы.СчетПолучатель.Видимость	= (Объект.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПереводНаДругойСчет);
	Элементы.Контрагент.Видимость		= (Объект.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ОплатаПоставщику);
	Элементы.СуммаВал.Видимость			= (Объект.Валюта.Код <> "643");
	
КонецПроцедуры

&НаСервере
Процедура СчетПриИзмененииСервер()
	
	Объект.Валюта = Объект.Счет.ВалютаДенежныхСредств;
	
	УправлениеВидимостью();
	
КонецПроцедуры

#КонецОбласти
