
Процедура ОбработкаПроведения(Отказ, Режим)
	
	ВалютаРуб = Справочники.Валюты.НайтиПоКоду("643");
	
	Если ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.СписаниеНаСчетМиша Тогда
		
		Движения.Миша.Записывать = Истина;
		Движение = Движения.Миша.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		
		Движение.Период	= Дата;
		Движение.Валюта	= ВалютаРуб;
		
		Движение.Сумма		= Сумма;
		
		Возврат;	
		
	КонецЕсли;
	
	
	// ------ банк --	
	
	Движения.Банк.Записывать = Истина;
	Движение = Движения.Банк.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	
	Движение.Период	= Дата;
	Движение.Валюта	= Валюта;
	Движение.Счет	= Счет;
	Движение.Сумма	= Сумма;
	
	
	Если ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПереводНаДругойСчет Тогда
		
		Движения.Банк.Записывать = Истина;
		Движение = Движения.Банк.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		
		Движение.Период	= Дата;
		Движение.Валюта	= Валюта;
		Движение.Счет	= СчетПолучатель;
		Движение.Сумма	= Сумма;
		
	КонецЕсли;
	
	Если ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ОплатаПоставщику Тогда
		
		Движения.Поставщики.Записывать = Истина;
		Движение = Движения.Поставщики.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		
		Движение.Период			= Дата;
		Движение.Контрагент		= Контрагент;
		Движение.Сумма			= Сумма;
		
	КонецЕсли;
	
	// ------ расходы --	
	
	Если НЕ НеВключатьВРасходы Тогда
	
		Движения.Расходы.Записывать = Истина;
		Движение = Движения.Расходы.Добавить();
		
		Движение.Период	= Дата;
		Движение.Статья	= Статья;
		Движение.Сумма	= Сумма;
	
	КонецЕсли; 
	
КонецПроцедуры
