&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка)
		И НЕ ЗначениеЗаполнено(Объект.ВидОперации) Тогда
		
		Объект.ВидОперации	= Перечисления.ВидыОперацийРКО.ПрочийРасход;
		Объект.Статья		= Справочники.Статьи.НайтиПоНаименованию("Прочие расходы");
		Объект.Касса		= Справочники.Кассы.НайтиПоНаименованию("Касса (RUB)");
		Объект.Валюта		= Объект.Касса.ВалютаДенежныхСредств;
		
	КонецЕсли;
	
	УправлениеВидимостью();
	
КонецПроцедуры

&НаСервере
Процедура УправлениеФлагомВлючатьВДоходыРасходы()
	
	а1 = (Объект.ВидОперации = Перечисления.ВидыОперацийРКО.ВзносНаличнымиВБанк);
	а2 = Объект.Статья.НеВключатьВРасходы;
	
	Объект.НеВключатьВРасходы = (а1 ИЛИ а2);
	
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостью()
	
	Элементы.СуммаВал.Видимость 	= (Объект.Валюта.Код <> "643");
	Элементы.Счет.Видимость			= (Объект.ВидОперации = Перечисления.ВидыОперацийРКО.ВзносНаличнымиВБанк);

КонецПроцедуры

&НаСервере
Процедура КассаПриИзмененииСервер()
	
	Объект.Валюта = Объект.Касса.ВалютаДенежныхСредств;
	
	УправлениеВидимостью();
	
КонецПроцедуры

&НаКлиенте
Процедура КассаПриИзменении(Элемент)
	
	КассаПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	УправлениеВидимостью();
	УправлениеФлагомВлючатьВДоходыРасходы();

	
КонецПроцедуры

&НаКлиенте
Процедура СтатьяПриИзменении(Элемент)
	
	УправлениеВидимостью();
	УправлениеФлагомВлючатьВДоходыРасходы();
	
КонецПроцедуры
