
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВспомогательныйIPПорт       = Параметры.ВспомогательныйIPПорт;
	Данные                      = Параметры.Данные;
	ДатаВремя                   = Параметры.ДатаВремя;
	ИдентификаторТранзакции     = Параметры.ИдентификаторТранзакции;
	Комментарий                 = Параметры.Комментарий;
	Компьютер                   = Параметры.Компьютер;
	Метаданные                  = Параметры.Метаданные;
	ОсновнойIPПорт              = Параметры.ОсновнойIPПорт;
	Пользователь                = Параметры.Пользователь;
	ПредставлениеДанных         = Параметры.ПредставлениеДанных;
	Приложение                  = Параметры.Приложение;
	РабочийСервер               = Параметры.РабочийСервер;
	Сеанс                       = Параметры.Сеанс;
	Событие                     = Параметры.Событие;
	СтатусЗавершенияТранзакции  = Параметры.СтатусЗавершенияТранзакции;
	
КонецПроцедуры
