
&НаКлиенте
Процедура СнятьПометки(Команда)
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	Для каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
		ТекущаяСтрока = Элементы.Список.ДанныеСтроки(ВыделеннаяСтрока);
		ТекущаяСтрока.Активный = Ложь;
		СнятьПометкиСервер(ТекущаяСтрока);
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура СнятьПометкиСервер(ТекущаяСтрока)
	
	Спр = Справочники.Контрагенты.НайтиПоНаименованию(ТекущаяСтрока.Наименование);
	Об = Спр.ПолучитьОбъект();
	Об.Активный = Ложь;
	Об.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометки(Команда)
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	Для каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
		ТекущаяСтрока = Элементы.Список.ДанныеСтроки(ВыделеннаяСтрока);
		ТекущаяСтрока.Активный = Истина;
		УстановитьПометкиСервер(ТекущаяСтрока);
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПометкиСервер(ТекущаяСтрока)
	
	Спр = Справочники.Контрагенты.НайтиПоНаименованию(ТекущаяСтрока.Наименование);
	Об = Спр.ПолучитьОбъект();
	Об.Активный = Истина;
	Об.Записать();
	
КонецПроцедуры
