
Процедура ОбработкаПроведения(Отказ, Режим)
	
	ВалютаРуб = Справочники.Валюты.НайтиПоКоду("643");
	
	// ------ Взаиморасчеты --	
	Если ВидОперации = Перечисления.ВидыОперацийПКО.ОплатаПокупателя Тогда
	
		Движения.Покупатели.Записывать = Истина;
		Движение = Движения.Покупатели.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		
		Движение.Период			= Дата;
		Движение.Контрагент		= Контрагент;
		Движение.Сумма			= Сумма;
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПКО.ПолучениеНаличныхВБанке Тогда
	
		Движения.Банк.Записывать = Истина;
		Движение = Движения.Банк.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		
		Движение.Период	= Дата;
		Движение.Валюта	= Валюта;
		Движение.Счет	= Счет;
		
		Движение.Сумма	= Сумма;
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПКО.ПриходНаСчетМиша Тогда
		
		Движения.Миша.Записывать = Истина;
		Движение = Движения.Миша.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		
		Движение.Период	= Дата;
		Движение.Валюта	= Валюта;
		
		Движение.Сумма		= Сумма;
		
	КонецЕсли; 
	
	Если ВидОперации <>  Перечисления.ВидыОперацийПКО.ПриходНаСчетМиша Тогда
		// ------ касса --	
		
		Движения.Касса.Записывать = Истина;
		Движение = Движения.Касса.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		
		Движение.Период	= Дата;
		Движение.Валюта	= Валюта;
		Движение.Касса	= Касса;
		
		Движение.Сумма		= Сумма;
		Движение.СуммаВал	= СуммаВал;
	КонецЕсли;	
	
	// ------ Доходы --
	
	Если НЕ НеВключатьВДоходы Тогда
	
		Движения.Доходы.Записывать = Истина;
		Движение = Движения.Доходы.Добавить();
		
		Движение.Период	= Дата;
		Движение.Статья	= Статья;
		Движение.Сумма	= Сумма;
	
	КонецЕсли; 

КонецПроцедуры
