#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// Взаиморасчеты.
	Если ВидОперации = Перечисления.ВидыОперацийПКО.ОплатаПокупателя Тогда
		
		Движения.Покупатели.Записывать = Истина;
		Движение = Движения.Покупатели.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		
		Движение.Период			= Дата;
		Движение.Контрагент		= Контрагент;
		Движение.Сумма			= Сумма;
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПКО.ПолучениеНаличныхВБанке Тогда
		
		Движения.Банк.Записывать = Истина;
		Движение = Движения.Банк.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		
		Движение.Период	= Дата;
		Движение.Валюта	= Валюта;
		Движение.Счет	= Счет;
		
		Движение.Сумма	= Сумма;
		
	КонецЕсли;
	
	// Доходы.
	
	Если НЕ НеВключатьВДоходы Тогда
		
		Движения.Доходы.Записывать = Истина;
		Движение = Движения.Доходы.Добавить();
		
		Движение.Период	= Дата;
		Движение.Статья	= Статья;
		Движение.Сумма	= Сумма;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
