&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Основание = Параметры.Основание;
		
		Если ЗначениеЗаполнено(Основание) Тогда // создан на основании
			
			Объект.Основание	= Основание;
			ТекстОснование		= Основание;
			
			Объект.Контрагент 	= Основание.Контрагент;
			Объект.Сумма		= Основание.Сумма;
			
			Объект.ВидОперации	= Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ОплатаПокупателя;
			Объект.Статья		= Справочники.Статьи.НайтиПоНаименованию("Средства, полученные от покупателей и заказчиков");
			Объект.Счет			= Справочники.Счета.НайтиПоНаименованию("ВТБ-24 ИП", Истина);
			Объект.Валюта		= Объект.Счет.ВалютаДенежныхСредств;
			
		ИначеЕсли НЕ ЗначениеЗаполнено(Объект.ВидОперации) Тогда // Новый, НЕ скопирован

			Объект.ВидОперации	= Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ПрочееПоступление;
			Объект.Статья		= Справочники.Статьи.НайтиПоНаименованию("Прочие доходы");
			Объект.Счет			= Справочники.Счета.НайтиПоНаименованию("ВТБ-24 ИП", Истина);
			Объект.Валюта		= Объект.Счет.ВалютаДенежныхСредств;
	
		КонецЕсли; 
		
	КонецЕсли;
	
	ТекстОснование = Объект.Основание;
	
	УправлениеВидимостью();

КонецПроцедуры

&НаСервере
Процедура УправлениеФлагомВключатьВДоходыРасходы()
	
	Объект.НеВключатьВДоходы = Объект.Статья.НеВключатьВДоходы;
	
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостью()
	
	Элементы.СуммаВал.Видимость 	= (Объект.Валюта.Код <> "643");
	Элементы.Контрагент.Видимость	= (Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ОплатаПокупателя);
	
КонецПроцедуры

&НаСервере
Процедура СчетПриИзмененииСервер()
	
	Объект.Валюта = Объект.Счет.ВалютаДенежныхСредств;
	
	УправлениеВидимостью();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетПриИзменении(Элемент)
	
	СчетПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	УправлениеВидимостью();
	УправлениеФлагомВключатьВДоходыРасходы();
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстОснованиеНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура("Ключ", Объект.Основание);
	
	ОткрытьФорму("Документ.Реализация.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатьяПриИзменении(Элемент)
	
	УправлениеВидимостью();
	УправлениеФлагомВключатьВДоходыРасходы();
	
КонецПроцедуры
