
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// ------ касса --	
	
	Движения.Касса.Записывать = Истина;
	Движение = Движения.Касса.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	
	Движение.Период	= Дата;
	Движение.Валюта	= Валюта;
	Движение.Касса	= Касса;
	
	Движение.Сумма		= Сумма;
	Движение.СуммаВал	= СуммаВал;
	
	Если ВидОперации = Перечисления.ВидыОперацийРКО.ВзносНаличнымиВБанк Тогда
	
		Движения.Банк.Записывать = Истина;
		Движение = Движения.Банк.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		
		Движение.Период	= Дата;
		Движение.Валюта	= Валюта;
		Движение.Счет	= Счет;
		
		Движение.Сумма	= Сумма;
		
	КонецЕсли; 
	
	// ------ расходы --	
	
	Если НЕ НеВключатьВРасходы Тогда
	
		Движения.Расходы.Записывать = Истина;
		Движение = Движения.Расходы.Добавить();
		
		Движение.Период	= Дата;
		Движение.Статья	= Статья;
		Движение.Сумма	= Сумма;
	
	КонецЕсли; 
	
КонецПроцедуры
