
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Выбран контакт" Тогда
		
		Объект.НовыйКонтакт = Параметр;
		
	КонецЕсли; 

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НовыйКонтактНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Строка_Контакт", Объект.НовыйКонтакт);
	
	ОткрытьФорму("Справочник.Контакты.ФормаВыбора", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура НовыйКонтактОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Объект.НовыйКонтакт) Тогда
		Возврат;
	КонецЕсли; 

	СпрКонтакт = ПолучитьСсылкуНаКонтакт(Объект.НовыйКонтакт);
	
	Если ЗначениеЗаполнено(СпрКонтакт) Тогда
		ПараметрыФормы = Новый Структура("Ключ", СпрКонтакт);
		ОткрытьФорму("Справочник.Контакты.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьСсылкуНаКонтакт(Знач Строка_Контакт)

	СпрКонтакт = Справочники.Контакты.НайтиПоНаименованию(Строка_Контакт);
	
	Возврат СпрКонтакт;

КонецФункции //

#КонецОбласти
