
&НаСервере
Процедура КомандаСодержаниеРаботыНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура КомандаСодержаниеРаботы(Команда)
	КомандаСодержаниеРаботыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура НовыйКонтактНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Строка_Контакт", Объект.НовыйКонтакт);
	
	ОткрытьФорму("Справочник.Контакты.ФормаВыбора", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Выбран контакт" Тогда
		
		Объект.НовыйКонтакт = Параметр;
		
	КонецЕсли; 

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПоучитьСсылкуНаКонтакт(Строка_Контакт)

	СпрКонтакт = Справочники.Контакты.НайтиПоНаименованию(Строка_Контакт);
	
	Возврат СпрКонтакт;

КонецФункции //

&НаКлиенте
Процедура НовыйКонтактОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Объект.НовыйКонтакт) Тогда
		Возврат;
	КонецЕсли; 

	СпрКонтакт = ПоучитьСсылкуНаКонтакт(Объект.НовыйКонтакт);
	
	Если ЗначениеЗаполнено(СпрКонтакт) Тогда
		ПараметрыФормы = Новый Структура("Ключ", СпрКонтакт);
		ОткрытьФорму("Справочник.Контакты.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
	КонецЕсли; 
	
КонецПроцедуры
